webapp-osgeo-live/src/main/webapp/static/examples/foss4g/requests_soap/GetDataAvailability.xml

<?xml version="1.0" encoding="UTF-8"?>
<soap:Envelope 
	xmlns:soap="http://www.w3.org/2003/05/soap-envelope" 
	xmlns:wsa="http://www.w3.org/2005/08/addressing">
	<soap:Header>
		<wsa:To>http://www.ogc.org/SOS</wsa:To>
		<wsa:Action>http://www.opengis.net/def/serviceOperation/sos/daRetrieval/2.0/GetDataAvailability</wsa:Action>
		<wsa:ReplyTo>
			<wsa:Address>http://www.w3.org/2005/08/addressing/anonymous</wsa:Address>
		</wsa:ReplyTo>
		<wsa:MessageID>0</wsa:MessageID>
	</soap:Header>
	<soap:Body>
		<gda:GetDataAvailability service="SOS" version="2.0.0" xmlns:gda="http://www.opengis.net/sosgda/1.0" 
			xmlns:swes="http://www.opengis.net/swes/2.0"  xmlns:fes="http://www.opengis.net/fes/2.0"
            xmlns:gml="http://www.opengis.net/gml/3.2" xmlns:swe="http://www.opengis.net/swe/2.0">
			<!-- show optional observation count for timeseries in GetDataAvailability response -->
			<gda:procedure>http://id.eaufrance.fr/met/403.xml</gda:procedure>
			<gda:observedProperty>http://id.eaufrance.fr/par/1689.xml</gda:observedProperty>
			<gda:featureOfInterest>http://ressource.brgm-rec.fr/data/Piezometre/00463X0036/H1/PZ/2</gda:featureOfInterest>
			<gda:featureOfInterest>http://ressource.brgm-rec.fr/data/Piezometre/06288X0096/SB/PZ/2</gda:featureOfInterest>
			<gda:offering>http://ressource.brgm-rec.fr/obs/rawOfferingPiezo/00463X0036/H1/PZ/2</gda:offering>
			<gda:offering>http://ressource.brgm-rec.fr/obs/rawOfferingPiezo/06288X0096/SB/PZ/2</gda:offering>
		</gda:GetDataAvailability>
	</soap:Body>
</soap:Envelope>
